{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_testArchesDualClass_1000epochs_archxsmall3_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1"},"registered_name":null,"name":"input_layer_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"flatten_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,27]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,27],"dtype":"float32","keras_history":["flatten_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer_1",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["SRaSPt2K6790EdO+3LrCP3/oK77/y7W9n3CsP5c+Zj9+278+ccMDPrjR7T6dIbS/GUdEvuuxAD7+KT6/fMaLv6+GmD5kq6A/KymHv39jMr+pkuu+ybkCv4XcZr1EQCg/TIGwP/6JUz7R2a++iPxfP7HMQr+kSys+/nYSvq3TQL9OwOY+lOWAPoHXQj4jeea/jzBTvwk0iT904DK/Y8ksP6wcAz92hDu/yW68voR6n76XCxi/Auv4v9iVh7/0dwFAf8nJvQ=="]}],"outputs":[{"shape":[1],"values":["Bv1/Pw=="]}]}],"trainable_params":{"conv_layer0":{"weights":["FpydPQ1UMD6qJB+/8SFFvv+VwT7D1pA/xuwIwRq7GMB1EzzAxQ+vP4XxuT6luZI/XcMHPHPkiL0XKdk/7/+MvkUI9j6iXs89pm1HPvtKvr6aulo/xj6OPyt6HD9Pe0y+86ABwaYwEz9Q6xQ/"],"bias":["f3Q1PhhJyT33D+Y9"]},"conv_layer1":{"weights":["8LvIPW3p4D5h3uI+caQmv02C670xBpI+YkQxPyqLJr3gxow+HaocwEMnsTySG+k+pYaAP/5uID9bPio/ELdmvyo2F74Ql3jAz2R0v5Jy0T626jg+/fkzvfdJl773LMC+IVjev9ehZD9Mtvu99Zc8wGAwCkDL4xW/wEHKvXgIoj8pwSRA3pFlv42zGL4JKOS+ue3evGuqcz9yaF4+cJSOv4z7K79XmRQ/6/O0PkdpNz4sCk2/xLc+v4IlrT5akJM8FBU1v4K6N792dhm//iMhPypdKr8jJis/E1hUveomjD1hLYU++R5FwGVK077ye6G/SVnov4acOz883lY+KjZjPdk8Hj8YiVC/GnZavyDz3j5ZyWU99HGhv3yJSD/keWm+s2E5PjhuGj5riA4/IbIrvwJw1b6Pvgm+kz3eP097Ur7g9Z4/"],"bias":["PyVGPhWRzzt8BnA/"]},"dense_layer_1":{"weights":["bs79v3DkdT1+J7m+DGSRvS1tgr73VTW/bF2TvjJ1Uj4nsM8+ISXzPHv7u77VpYA/2IVRv8i5Pj2Y7xXANdEjv9vs4r4FrC6/eCq6vTTCAT5UA7E+xzYvv7w/Ur4sly3AC8gHQDvgj76Ru4k/u/edvqPnSr7jU+C9oDdAP0VYz75bfj2/8P5nP6Y/Ybw8AQu+AO9awEovbz49SKe/ZaFjPzXHDr7CVq6+rlEMvo1PhzxDBRO/rGQFwEQehL09RPa+zEVVPhF30r7Z5cO+/fqXvknTWj6p9VY/DIWBvcqmhz51lZ6/UD4VP+nLUDxrNWE/IPxHP/Yegb4t8QY/NhR5vWk6cb6wvKi/8unmvjXyRD6XSS8/g7uZvvkh2b74lHI/QL6kvUoVu74Y/0+/iVYJvzhgED6TZ8Y+LhZdPwLQmL5meCQ/"],"bias":["gBh5P4LzlbwXtiE/"]},"output":{"weights":["uDg5wCYUkT/e4YPA"],"bias":["cAAgQQ=="]}},"hash":"85c3dd69817943658ca9b01a085e139c653a388b2ed86ea623140ccfed5c00cd"}