{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_testArchesDualClass_1000epochs_arch3HalfTallHalfLong_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_3"},"registered_name":null,"name":"input_layer_3","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0tall","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":4,"kernel_size":[3,2],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0tall","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer_3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0long","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":4,"kernel_size":[2,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0long","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer_3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1tall","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":2,"kernel_size":[3,2],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,6,4]},"name":"conv_layer1tall","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,6,4],"dtype":"float32","keras_history":["conv_layer0tall",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1long","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":2,"kernel_size":[2,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6,5,4]},"name":"conv_layer1long","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6,5,4],"dtype":"float32","keras_history":["conv_layer0long",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2tall","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":1,"kernel_size":[3,2],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,5,2]},"name":"conv_layer2tall","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,5,2],"dtype":"float32","keras_history":["conv_layer1tall",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2long","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":1,"kernel_size":[2,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,3,2]},"name":"conv_layer2long","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,3,2],"dtype":"float32","keras_history":["conv_layer1long",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"padding":[[3,0],[0,0]],"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,4,1]},"name":"zero_padding2d","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,4,1],"dtype":"float32","keras_history":["conv_layer2tall",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"ZeroPadding2D","config":{"name":"zero_padding2d_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"padding":[[0,0],[3,0]],"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,4,1,1]},"name":"zero_padding2d_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,4,1,1],"dtype":"float32","keras_history":["conv_layer2long",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Concatenate","config":{"name":"concatenate","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1},"registered_name":null,"build_config":{"input_shape":[[null,4,4,1],[null,4,4,1]]},"name":"concatenate","inbound_nodes":[{"args":[[{"class_name":"__keras_tensor__","config":{"shape":[null,4,4,1],"dtype":"float32","keras_history":["zero_padding2d",0,0]}},{"class_name":"__keras_tensor__","config":{"shape":[null,4,4,1],"dtype":"float32","keras_history":["zero_padding2d_1",0,0]}}]],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten_3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,4,4,2]},"name":"flatten_3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,4,4,2],"dtype":"float32","keras_history":["concatenate",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,32]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,32],"dtype":"float32","keras_history":["flatten_3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer_3",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["3zDqPhCTAcArc6K+rzmavuAkhz94dd0+/8Umv2/QTj8Gts8/XVdWv3Qy7b40poI/qOYNPyx2kr94tXE/U1nVPwlzAb48W4K9otg8Pjr8hL7FQ5k+++WRvdPTSz7ANaa/XzokPzDwmT6VpzM/+YFOvC1zJz4YslI+Ll5FPmF9eL/EvdW/3bklvj/Cx77oL1G+bgVEPcZkoj7dJFG9QRnlPqpLAj+pHfw/Z7xNPhw6Qj2wATa/NIVbPzQ8sL+8ypg+/0gwPw=="]}],"outputs":[{"shape":[1],"values":["AACAPw=="]}]}],"trainable_params":{"conv_layer0tall":{"weights":["oM8ewK4uHsEmSo8+A/A9P4ps/j7O0eC+3f0OP/SKIsGmboY/IBWCwK5vNT98LdnAT6IqwYl41r9Kh08+SmfMPg9EDz9FnRS/Ycy+v2QoQb7XEg9AhqkRP+1I1L46Mtq+"],"bias":["M2O6PYL+Lj7MkE4+86rbuw=="]},"conv_layer0long":{"weights":["1pikvS/AGL9IFKY/WHpkPiOEIT/n3HK/4cKdvg5fWj9NqwU/SHBFPxoU3cDXaA3BHsKnP6dP+b9G5Bc/wpEaP4XN3D2624q93zNuPlbOiD4HeEE+tAKsvlRiLb9ESdI9"],"bias":["IkAGPpKBKj7Z+Oc+0poGPw=="]},"conv_layer1tall":{"weights":["vINqPw+JSECg8vy/BXeiv53oPz6F9wG/R/2mPRntjT/9yD2/CMltP3omxjxVvbA+V4MBv21+F75WJHa+yBHXPgGMCz+qWHm/c6kBv5Tesz7eWjrA3wgiPzqNSb66d1A+55aOvpfFjb1hLia+E6qivhPSAD6m0oK/XUbjvaqV1j693RC/nbggPoCf8z5AMy2/J38yvxCirz8e1Qq/7OCpv6k+qb9NxoE+tlTEP9tHIL9ajoc/qfThPw1kD8AvkaC/"],"bias":["uB4uPulG7D4="]},"conv_layer1long":{"weights":["AdBAPjs6acDcOc0+f8u8PpgBuT7JRdm/BFWHP/QWRz6pxtS7FPHCv4oZkD68jLG+5AFaPiO2Ar//pSk+ddwTP2z4776W8ES/tFtTvgrwxL7fPSM9hYievxw6M78YBJk/iGUgPw4iVL/ML6W/Wq9WPOZo8DypSFe/JNuWPgAHGT/55jg/+HogvtQ5HD80A4E+1YITPyDeFcBxGao/tnjyvZCq8r9SMbO9jzYZv3KBkz6V96E/ncysPjXprj6YRQg/"],"bias":["dAvkPraVMz4="]},"conv_layer2tall":{"weights":["XwoUP2R1B0DnePk/+6F4P8bHkD63sYW/q5YPv/p1UT4b1A2/bU3tP6dUFr/xyLU+"],"bias":["oaW6vg=="]},"conv_layer2long":{"weights":["ZetEPycHPb5Ufhy/enCYv8D2xz/rE46/8mKoPxUziT9PftE+8ud0P9KG1z7W9iI/"],"bias":["fiOrPg=="]},"dense_layer_1":{"weights":["sKgEvgTawT44ntu99NAAvhBVOT7cklk+oIWGPqAbtj5hEqC+gJYKvJ4zoL64q3W9uiaXPqDe1jy8cGc+1ByNvsAvwztgkxK+ABF6Pvn7sr5O+Ys+fi2HPmzxub6oXjo+6UOTvhwd3j0diSm+emOKvkJjuL5YCa0+JPp1PmDsOj5sNq69YCfBPiB9VD7QF2K9UICtvHCsvD5wQra8PgGmPoB0ubslvIW+YHJRvEywOT6DT8K+TjydPnDnbj6QU3u9SLumPoCoGj5zCzi+wKk9PZ5sF77Ya2G9QD8xPjin9D3w6vq+xJhVvid2NL63lWg/RXCyvkZ7bL99iGS/0xmQv2krEr5cM4M+FLaTPpjpOz5yqAO+cEFNvXRnMb4O9Kg+vP13PlVlv77wQLw9mqgLvsr5Rb7o60C9tH6uPqyfrz3kvoc+dDv9vRWJHL5ew7s+seJ4viCBrj6wJzO9fiybPkgtXj00SJi+UIhKPhKiuz7+65c+twBSvkrUmb7kT68+lOBgPlQZOr4NVKO+4JqwvHv8mL6kUYm+wGV7PoCOTz5If5o+lA+ePmjFgD6Y8sQ9zGPpvUjqNj6UkBo+Zv2DvuWdkr4G+ri++tOOvlgbGb6vH7K+4HhVPfRPsr1IaE29thn+vnlxwr7Cnjq+oD3kPkjRUb2tk7q9UiL3PorYZz4QmO28LtGXPnTisb4epTS+JCBwPgCEED7AV607HMZFPpS4vT5c28E+VNq3PdQLQD5gB+o8gNoWPUDmFzwI1GM+4uUbviwuhD44JbM+bME2vjDZobzYz+o9DBscPjRDiT6Ensa91CgSPvkNjr40b7k+F9HDvj6QrL4s/rU++NjAvWqmhL7A1z68iEVPPdogs77i2JW+rPM2PuRQKj7Q4bU8LoyTvlcEtL6QucK8bOm4PkAJOT5UdA8+Te+bvuVLOr5Q8KK+QLXOPThDhD1ANsu9Gty5PmTKgD7wkDI+Dgy5PiZqBz+vWGS+RQlwPdc5s74zQZM9d7fMPxQlRz3jvqI7","rNZMvnzsk71hXzu+BTEJv5sQJL4Y5sy+hkt3Pyejnj+w0sE+XuylPhiffr2gyLE+PhyzPjCNZ71Ia/o9VJEVPnn6vD9gPwI93AvFPUmsA78SOHu+eVx9v7EPxD/3FKQ/INl9PMhNFL3wZJA+GFiRPfwS6L3gcCg+2A6SPU8UZr4J6G2/gXdxvk9dub79csc+J/aXPeBNEb+ubBw+VEziPnjbM72scqe9tkfBvtCssr0AYPU7MMtEPjMelr6AZfU93UMIQIihDz0eonk+OtKBPgh0yT0fq6U+KDUuP+Dtaz+0uu8+4LMXPhONgr4/Zaq/cuW6ve/yBb6hWlY/d8iJPw=="],"bias":["stuJvwAAAAANnyI8HJPgP+2J2LwzFu8/Py6Pv7Mnhr8="]},"output":{"weights":["YvO5P6hfR76hPk++Y8uvv9NsuT52QSHAaQfAP5EY1D8="],"bias":["6TzGvw=="]}},"hash":"2e462e875f055ea1417c27b9a45997cbc2dee46fb90d3c2fffeade703c034817"}