{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_testArchesDualClass_1000epochs_archsmall3-2_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":2,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,2]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,2],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,2]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,2],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,2]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,2],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["03aCP6ebzr/b4Fq/AYOUP5N4eb/rh0C+wSQ0v5rdsT5d0pq/mSwdPiorCb9y6VG/FSCwv1HBXD47eCG/Q0MdO1lxUb/N/aS+1y6SvvVUqr8Bdak/skoePq1PlL9q2q++XSIuv3lg7b6QWNm+NNS8vwopsz7b4Xo/sdFRvljJR78a7mu/K5mQPn/jlb9EEp6/N2XLvR8NJ7/UF+s+QkL+Pjgj7j8kCfg8PxsMPzVEXT28sYa/gsWhvxxxFr9Q4xi/gdOoPg=="]}],"outputs":[{"shape":[1],"values":["tjqbOA=="]}]}],"trainable_params":{"conv_layer0":{"weights":["1CAbQNJkWz8cDK+/3AVev4JK9D74FBI/vsfAP+m3ur9ZTR6+Dv5cvpanDMBX0wo/0GWJvOcLDcFCMke+HOFMv1pCG75n45Y8xPQTvmfAOL2lFj6+pHuWPqlBoj4KGkY/EMZfwBzLer/Wd1vB"],"bias":["uOjJPS6e0D7/+lY+"]},"conv_layer1":{"weights":["ohAhQJw/pr+rrs6/+JALQD3eEr4KGS/A1TIJP2B+tD8j2dK+1/joPuiwX79nbse/7SuxPvYXH7/GPP+++xcFPQUB+b+VHaw/u5VjPTCDCL/1+u8+sM4/PwhOqT8BTT0/3z/KPqMqxD+yYdc/aKchv2TE8L0aNcy/oOIZvFtxg78jjINA9mgRP4gBUb/9CWbATrSQvlyLfL8lTzK/9b+xvYf4Zb/D4yPAVT+/Pw84vj/Z0qU+1NU6P1XDND7uccY+hKTqPkLB976KOxS/nL4EP5+Ysb5HmJu/1mYUvGdiyD6iGbY/omlpP4FDob9b/oy/hFHoPw7NWTtXagU9WlbYPToURr+u+5u/BaMMP3bMJ75UoKO+MDMPPxMDjD8VJQS/q5UtvWJELT8/eEXASuNvv4kfND5ofbC/keR5PiCGzT6towI/"],"bias":["P2VNPkelhj+nFl8+"]},"conv_layer2":{"weights":["V/pZvqeiLr4ZiwW9Ki2zvjOLhz4Jh6a9IfO+vR/2X764KXq+7JSuvVUo276HZ3I+U7QePmugSD60aA6+z+RNvnWzCj0/Yoa9sBA9PjbJpL7ehpO+HMBhvuZy0jzyCk0+XSxQvu8M3jwK2s094mC8v3BFPkDxEUW/76GfPjhSWj7X9Jo/5/IbP2nHjL+Kk/E/D0iPPZwEbr/rudE/ugzevyKvJ75mpYy/MK07Pw1CT78iIzA/8ZVRPklkMj+pUVw/0HPCv+YlUz+HyfE9arwAP8SgjT6HbqU+"],"bias":["8g6YvalJpL4="]},"dense_layer_1":{"weights":["FCpNvwxCyb74QpO/Jr8mQA=="],"bias":["AAAAAGWSB78="]},"output":{"weights":["39iVP1no1D8="],"bias":["hS0YwQ=="]}},"hash":"119455854a8ffe133b4e0af68511cce5bd47ba8ea5355344595a317e45ec8920"}