{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_testArchesDualClass_1000epochs_arch8_4_2_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1"},"registered_name":null,"name":"input_layer_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":4,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,8]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,8],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":2,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,4]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,4],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,2]},"name":"flatten_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,2],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,2]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,2],"dtype":"float32","keras_history":["flatten_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,2]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,2],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer_1",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["l2QlP8kHwj8hx8Q/PumKvXtThb9lr92794GDv4VC+j5fqSS+iZUhvcVvC7+lhJa+v0Ygv2ttrb8yVBu/f0aYv0k1Ob/NLxNAlDcQP4gPnb+RKr8/y8Emv9DaAb93WGG/4Xg2vk6wAj4kSoy/Sr+Sv7058T6hAXQ/bTDLvx7BCcBD1Sk/qV75P07FB7/V1PU/nv6CPwRWFz/hu9C+B64yv2pyLD9sPps/AvcKPySGhz9gpTC/fiH7PpzWAz9zkbi+1+Vbvg=="]}],"outputs":[{"shape":[1],"values":["AACAPw=="]}]}],"trainable_params":{"conv_layer0":{"weights":["pqLlOxoHkz7EjIq8rhclPlEnnT74g6m89BGXwG0k8r8eVKa/eHLPPq2zUD8Trms8kB73PlJBMcBgWoO+xXsLvK1HTMAvwpLAbs0SP4PXlD5KywU/lrmPvWXztDsXF5i9E3FbwF3NDD/tKVW+oxSNPlRkeT6WLtU+0LVsPCiv9r7jGok++pvGPpyJvT4q0dnAR00qP9Ryt71+JBc/U64TvwG+uj55UzO/MNPiPaFdhT7PTxS95NPAP6Ujhr7Db6i+3wW+PfsMbT502gG+pI+OPFDGSL4KXOy79P/0PoIBZb4tuTs/aH94vqlVaDy08GS+DFEPP30R8D5QbEQ/3LHGvrd0xD5LRnk90ScxwEf1I8CgSf3A4mMbPtuEFT4fyfO8"],"bias":["yaAuvZcrOz1+0AU98xbaPUFuuTspUAw94lrkujj0hz0="]},"conv_layer1":{"weights":["mG2Yv9quHkCwiGo+2LvHPy9muL17rnK/KXOhvm/OHb+MbLI+vHxGP9ZhFj8+mIu+KQjDPsyL4D7l0qc+eT3+vvzYPT79BOc+kpacP5hpiT45nC4998RlPgHUG77HzMS+JKfAvWUYoj+/VeE+wJREP68C3b64oT+/D9WMPuK37b4pIz6/IPwDPCHUxb5F7+6+VdoKv5wMaD4E9vM+4X86v/Wz3j350xU/qsaBvlQ9lz405N++EcggPKy5nzzRCZo/4Ur+vTSJJT+pgH8+kROrPzkTRzwG+V6/8Dw0v/QZcz+qIvk9L7dvPnZtGb/V41s92PJ+vhm9Wj6mwuk9K4i2P1NMhb2kyLi8Xhj2PSFi2L4AAGW+YLdRvl0hJL9d/TQ/LcqLvXgxmr5sqiW+9vtlPb4SeT3HRW6+aq+0vpdndT9uyoS+Nn0Iv+8B/r5Q/KS/x3EEv2OZYr8c1wu/cdq9POjH7z71Ewm/rS6mv+lDr76ufum+QcgBvye4IL/S6DQ/m9I/P816sz6uC8C9AFCfvJrtkz7y4Nq9bSN4Phj7mb8jB6M+HOkWPWyfwj4oHDY/5EHvvW/vdz5mjLg+0qaBvnGLfr/6lQ8/moImur2OHT85iqW+mFoaPe59tj3dONc+PbLlPaANpT9x5HU+pXsjvTiJpD45SFY/gBSFvb5O7L+gAr4+wRCtvW3sej4CqR+9xOsjPJSjKD4LkyM/NxF3PWa7UT6UrMi9kVJcPpanDL85ndA+elqLPjqvRD5bWUw/tOUMv0IqG8BbSVi/sk95vxxHKju00UY/VFWyPoo/gT7tfWC+qVVEvMimoL9U9FY/P/8gvrvtIb8qEhM/d2sfP0TSWr5XGWS/69mMPrRJpL5LUno+dJ4iv1Nl/b3G7dm+qgFgvusQO77F49Q+0+hFv45yl7xOZH8/zQDrvMM+wr09utM+TueKvoGeLT6hDTm+1JJAP9IZRb6vDts+GT6wP6XlO770pEe+c+jkPq4doDsWDi8/edzdPL4RMj125iq/","TcYyPquUJD586va+d85+vv77Cr8PmCq/5KeSv06fCz7QYAe+v3MrPc1Vjz0a+yW+2HbQvp5uFr3Xe+O+zpz2P/IkVL9r0tq+dg02P3j+N75bFyA/b8qbPtBavr0vbFG/J8e+vkfDr74Nzra9Fb2ZP5lGNL8Xrq++m8UOvcH80r81a3i+isArPtcL2z64jJ8+GCJavUyClT7ayCQ+lk74u6pTqT/7oko+cK3vPiI7nj4Tc9Y+4MXBPjC87DywX5y/SvgKv/QS9b1oaPY+6dzRPjSsAr/DzUQ+79Mivy+qQj+rzPs9OBWxPmjYyjuM0z+9FIbdvUo8rr2Zzaa+SHCPP2/NoL+X9/0+5JxFPXVhqT2HnCe+YOudPmhE2L1UoZQ+JVDSPaGS8L/e7O09PTZrv5HEFD/TpVO/XCWgPmeH3T2G0O6/dIuCPYpNwz08bRK+Vo0wvoooozxMlpM+aXC6vtOnU7/hE6w92TIEv0F1MD5H9sA9ztiHPtDdVb6H+pm/"],"bias":["N61fPR2SnT06lsQ+KXK9Pg=="]},"conv_layer2":{"weights":["tfcBvzZPab+qj0c/KfNIvmnkmz+wtzu/VG/tvipNoz00vwg/lAg1voRDpr+Pri+/FaI/P5UtSb84GLw+C8aYP/o3JD89DIe/3gyzvomdEr7N7Kw+ZXyIPs0urr5GqNE+vY+Hvt4bAr8FI2A/wpn5PuO0Mb5ToeS/7wgvP4qpYj9+Ee47GDhjvoflY78zvVc/gR+Lv0ZSIj+yhPA9yFuSvn7yQ7+jn+u+61tGP1y/WL/4RGi+heJgPjAVej9KzqE+Oqa9PUGiPr9sISO+QgzNvsPsMT8cBJY/fEhePvbNGj+TUlM9FYmivn/ijjuGooe/fF79PsJjUz2Lsdm+Pud7PjX9Vj4uF6Y+tQifvxCsiD3e9rA+LcKdvxKKQT/AVpg+"],"bias":["Ai7wPeodET4="]},"dense_layer_1":{"weights":["aJm6P3IfAECcZau/bg8EwA=="],"bias":["8LSqu1Wqzrw="]},"output":{"weights":["nkYnQEmuFUA="],"bias":["LH8MwQ=="]}},"hash":"8233ce282e5cf09ff5c3230ba6c2ffeff5a8f9369ca8a252148140bd2c2c81ed"}