{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_balancingClasses_4kEGammaChunks_newPreprocessing_test_isoShape_1000epochs_large8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,10],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,10],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer3","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer4","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer3",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["dense_layer4",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[10]],"output_shapes":[[1]],"tests":[{"inputs":[{"shape":[10],"values":["cMDzPysnEj8zQHe/5iK3PjKHDb+KroG/WIG6v9PkRj8FZF+/eI29vg=="]}],"outputs":[{"shape":[1],"values":["AAAAAA=="]}]}],"trainable_params":{"dense_layer0":{"weights":["US5zPrjSUb8fpIA+1Xpyv6j/FD8O3Pi+kwPNP7WFJ8Dz5BpAB/R6wKFYEb+fOG/Cn9IvQDaWMr8eEJRBnROzwVv7GT6kBrc828fLvpIYCr5NtRw9f/a4PnQDDz3gn/i3TlUEwLbBr0B9B5+/XpC3QGUGGMD5Y2xAJnIswSmBr0GlD8M9F436PrNtBD4VlrQ/aX5tvaAo/j/xZXRA0rr8QNrEOr9muGm//RsDQk40lj+HI44+9Ba3QbhWK8DmQmA+QPZbxD1VlkI5y1pDnif4QTuLCsLIU0jCJ4cZQ4txkECLU8JCePyIw9DLeMIySL5C1IcSQxSx2sMcHA9DJp6GwgiiJr/RdCdCbhLfv4eVoT/x8ynE7EJjvzhLwr8mTge/IZumPySlm8EVHqJAERRsv85PlD/7CSTBkkqAQFg3Cb4="],"bias":["PoArvZ+lMT0epD8+r5GyPsl/vLoEua29TylMvpAqDb0="]},"dense_layer1":{"weights":["uTIBwV/8hMFCfFXAk0/nwNfnLcAKTYLBR7F5wTO25cBz5W8/cdqtP1Lz0r2sWkS+20Fuv0lktL7JVrY/X4OlwUY21j+hOp89zLs9P46EOj7mnoNAz546wIfcpz6o+Eg/yee/v9xlXsDSete/MwCTP233GL8tghLA/ym3v2ZeL8G4NKc+lY6WwdOkoEFpZ3RA3C0Rwf4lq8CO8mG/zedwwP/PhEAv2pq+l1TDv6L1vb66XanA/1paQAVJsr+59aI+ro/bv2i8FcAApa3A2pN2v+W+QUAO0Ky/RNEgQJXLhT0aT1k/SktIQKZc40CFNdvAUf66v2+rtD8RaY2/w3SCwA=="],"bias":["Q458PocgCkAUcWy+CQczQJOPSj9cB0U/UI5lPxxbrjw="]},"dense_layer2":{"weights":["cWR8v5lupz9/aHI/sAcHv+bffj6zCyi+jWR/wBG8nr7zKhHAeT/4v7EFBD/jnBpALdayvwKDXT3Myqs/tEIIQPwF5r+mp3JARafTPLUOlsBxr2y/IUp5v6v6Dz846R++UvglvU23Sz8wsa6+bwITwLANaEDUyco+WtLwvrAvCL8cUeA/EggJPxH/1T9i2UA+PaIZv75lmsARmXS/rSo/Piktm0DP+hZAgoXSvir9dUAoO2M84dSeQFVCxz/uN2DAikppP6Ca5L+4f8I/H1AMvxJzGj+H66++jj/0P8GHDsBpNcFA76j1wMwdvL9pL0Q//PtXPQlJ/sFB2Om/F+I+Pg=="],"bias":["bSkBQIBErD94GD6/KxIwPzt9Lr+BF0g/8tymvo4ehkA="]},"dense_layer3":{"weights":["Wm4lQDV4OD+H1v0+IDkYvxuQT763FRw9mCWUvROlST4MU6Y/o/gFP5QI2b4ppLq/5X1Wvqs/+rtlRgc+440DvnHRlcD0iqi/olUowN/ZxL4VtlQ9tVasPl4Kgr8yfQe/LrekP0L2hr+QrIm/0VsPP0Z8qr1V1ng/aIaGvmI9hL9a1QG/P6Q7P0nWoT4Zia2/wQSDvmKTAr9OEYo/6aBEvf/Kx74ijTy/nZojv6es0D48yIvBKXesPiNhKD97MAK/aRvjvt17TT8WbBlAOw6Gve9XisJDLsO/LhHLvE6c5rwwpL8/cXWlP85ykz8hBjc9scMrv4RL1T9C0sw/vNeLvg=="],"bias":["XJzdvwpCQkFbytlAvL+tQC2QA0B25Z7AFDAPwFDbIL8="]},"dense_layer4":{"weights":["1sE0P2zZMb/JZGO9X3RkvxjipD5rkWC+pNcpv11Rs77NWbi+s3NOvxSxcz0Rv0s/3bQDP7krgL9vn7097xMtv7B58D3EUmm/YgwqP/5Sur7qDQc/zWORvkdyUz2PjpE9WzndvRFcnD8zJhJAfYa2PwT5q75T5qA/XqZaPipas7+Dlp2/7OAKvyvT5r7BOh9AurcavwgxL0B7E0m/NTFpwcPiIT9/JlE+xOT+v94TD7/BBd+9xIkPv3FyGj/2g/m+dLFiP+6VCkDZ9S08paefPRckFD/npro/WSwnvoirwT/Gsbq9N3s1vNnYHL+kk6u+53z0vudm9D39z5K+Se8gvw=="],"bias":["rk0swYLSj8CQxfDA/kgYwUww9D4+D6/A3Au4v9KahkA="]},"output":{"weights":["EPZsvhGdMz7L8CS+OM7UvfSfhr58KRA+1No1PsazZr0="],"bias":["Dc+TPw=="]}},"hash":"f6fd47befb5dbf2f622f649cd22b1ad9537042d37657d332dfc72006e4fbe000"}