{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-DNN_photonID_shape_500epochs_med16","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,5],"dtype":"float32","sparse":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5]},"name":"dense_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[5]],"output_shapes":[[2]],"tests":[{"inputs":[{"shape":[5],"values":["9uKvP8SLD7zXIwe/j1BBvxXb7T8="]}],"outputs":[{"shape":[2],"values":["pKQdO1tifz8="]}]}],"trainable_params":{"dense_layer0":{"weights":["QX1tvoEX5z4VRhW+npWeP1jE4D9KJZM+8XU0v3UnY8Cp8cq+fSChPEYO9T1s7aW+11YFQDRI/75PvXA/mqlpvrENhsAmZx1AScirPPQFaL6hs+k/5NApwM1Kt7/1jY0/BY1kQEQ20j4HCJQ+2CngvqU/bb+YjUK95PqhwFz9LkD4Glq+dm9/uEBGBDxybwm9xB8IPshIoL/vBww/lFAGO2hdVj6TDyY/VwtRPupxDj61xy2+mIsTvkDxgbxLftK96qNRPZLmWz/J9mC+f8IcQOvLQrwMDII/BkHxP4N2rT+UngU/zxXAvdq7YMDXxWlATtuxPqTPlr5tSzu+uCULPgP83b+E+ri/80eyvsnZB798PN2/Ubu9vSHu1L6q2c09kI9Gv27mjT+d1xG9ik4RvTzfoz9qCKO+xh8bv/6t1b8="],"bias":["U5CmPvecrrwXOSa8A9jOu2mHBb7l7Yw+YW//PSIqXD6yetS9FNcTvf4aqD6Jga6704WovgAAAAC3Pqc9Aed/PQ=="]},"dense_layer1":{"weights":["hfpSwIh1Wr8qbrw/3JKTwJevvr6UA8E/O4SovSftAD+k2iu/Df/Lv3VN4r7/3ti/B+KqPm2IMj/3B1k/tJFkv3DlWT+rSO8+0i8DvsLB3D4SGqK+BwrKPlbvCb6ND5y/juAzP3o3Qz1r0Ha+cgIAP1OCrT5V7iw/PpDPvn/QIDxVyqo9XjIVvsNFDD7Ql5U+EPH9vWobqj7FB5S+rCubPYAE9r1tOaG9EZGCvWoDGT5zDI8+Qu9ePpu+lj5CAAG+eh4KPfTtpb7ywV28XkIJvru7+r77zbA/wWvwvPQN0r/jEyU+hKRrvtQ00T4BXOe+d5kDPkQkMT88Ghw/pvCOPjDYsD5fk0E/6h1/PxyQFL2C5Ai+gqV/vsO7+L7thoG/drkav6suoj9JmMm/jwZsPnbJtb24Wcc/PlWJv3ok9r6tD9W/EAKLv/c49D9Jm4q/iJIDPhYYMT7dync+XEMdP/cMwL4fxMu+0gZDP+gzDj8BjWO/iA+TPytmcj4Rn3Y+oMxTvYLRjT7eB5M/8kswvwXVub6itxU/5VyOvqNXJj4NGv47KgtIvlj3zz/nnIC+hctRv03l+b7Y5RA+kKcFvyIpvL/Xz7+/B+VcvxhC1T/ODBg+QKImviRLhrtRqjLAb4/TP6XThz+osnA9GZATPsumib+kEQ3Ae1uhP7l4HMD9t8c/BB31PoFhPj57KtI/SqnevoLzXj6csrS+NxYUv3bpij/EeL4/MuDjvvFAMD/DmEjAyr04vzYiOL9zkBA/6FbwPdx2Pz+UM4I+LU2sPpBYGb6oy8Q+zHCMPpSI7T0+ML++XtW7vuqr8z3yTQu/zkXyvnfDcL8RNoy+HIOFPjft7L4TtJK+dwKKv+FRkr+pNgc+cJhkvxodlL5D/xk/QH+8vQmM6D6dpV0/ifalPiCOxT7M0Yg/u3X3vrDzlD4xPss+5oiePqg0Hj/F2yW/b7B+PlovhT9jc+E9SO0dv51HCj9C97w+VgqYPh5brj5t56m/tCJuPlNrHj9Z/1c/","t/iOvgr7Xr75Qdq/8ShFv567gD4ELwG/Ez0jPiuP5MBFCHk+JXxoQAcEF0DeNydANbGXwI7w179G4sLAsgNFQMDczr0DWd0+XX+uvkngvz6w7Iq+QMOFvmhkSD1Hg1u+uTauPgb0i77Bw4M+nvkKPnpLaz5Gsx++1dm1PprGOT4HdCZAHiwWwF3xKsE4SLM/bmMtvtLoTj4Z3IO+AR4cvhYL4b/rW1VADUGdQB1grD/A3Cq/lp9Wvx+gQ0CKRBi/v+GFPxPYFz47fze+zfKIP5LYxLwCDXI+rItUPXqXCb9Kd2Y/jmwtP8mzvb5UW4U/4v+yPgpivT7R9Ly+EtHjvg=="],"bias":["+Xk+Pkd4Hz7x3a++f1ozPgPAe70onVO+5/OZvYE4RT7CEKk9mTh/vqmCob55T2491gnbPikQKb9ViPo7nb7mPg=="]},"dense_layer2":{"weights":["9eV1v8ae5j4Y8A8/mnaDPyiCS7+IY6Y/AiFkwB8mBMCnMLW+YI9BPa4rkb6//ju/6OzQvts/CMDxN8i9auB6vqOMjL8RytO+VSOCPXIIiz6K2sU+LHArvbruAL/RhRY+o+27vpCPsD7aM7q+CMK4PS3DRj4pGBq+GAtfus9u/79MpQM/5GvivreFN78Bp8u/CTF0vrhJ2L50T9S/3MVTwCDPh79R/0i/dxZxvt+6P7/bAaU7rUUowBjNYcDLJBy+SI6TP/2fnb/zWGq/VTMbv/dTEj/0Fo+/OHKLP5aMjz6WNmw/sKIevlEqPj46Xm8+QoILPuyMYj5od+Y+6xOSP1Uvgj5UFB6+KCfePeOBF72NC4O+ObpKPQjRkr4Rily+RkqlPrpcYL4AJCg6v4SLvjdEZb4BwUu+FpMGPuBdNL3etXS+N+6jPhPNdr03fT0+laomvHT1tbs582W/Df10vizh/r4gfLm/n6rJvkdfCT9lZsW+r3x7PxyWecAuQfw+TX2Cvk5WS70myzo+c9EbvL6qkD2Om0e+7bOSPpSA6z2+7hk+6LMevupdCL55NkW+Kl9TvljfVzxCLi292/OrPleJsz4MO9m/Q1lYv50+Gz8IA0i+kqCjv06ICD8bj4y9yHV0vw81YD/OV4m+e6V3v1bCz8Cj7x8/OsH0PheNUL/zc/2+SmyuvWgDVj9NZLY9VwSNvt9X8T1msYc+DU/+vpzSAT9vRBm9VlQnPvFJ5r7W6/Y9EbK1PmMMbL+uRiy/jcKtvy5/qj7juN29YFRDv71jQD9qOG6+Dzi5v77zhr7IVQc/BlqUv24WC75GzXQ/3DlbPw8a4r+y8SI/4M5OvZqZgj/u5yI/R8w9Pz6uCD/adL09BXQOP4TuNz/enJw+6p2UPzkUe755S9W+ypqmPgLvnT89wkI/229GP1v1Jz9koxs/6c3YvATf0z4YLtC+2Y6pvRfjDD5xe0e+Yb9Yv2okVD+IzIW//7bSvoRDgr4e2Z0+lwN1PiVWqL/XuZW+","twmJPsIpBr/OReW+bI2Zv8fYGj5oz4fAz7sjv2enBD9716i+spUXPplus77LevK9yeC4vitFiT5t6g2/aT0jPx7m6L8BmSNA/izdvxP+nL/GIQ5A7f/KP6Cojb/dLwFAVvuoPrc+UT61brY+E9UQQKmf1MDCmfc/R2wJP9jv077MY7i/NZOnPeZNer8TnVM/66IvPg29Gz+NwsI/J9O+vhaXeL+A22Y+K8VPPhibLT04sn3BGWZ+vZK8CL7NSRfAWUFUP62Ogj6kKpE+AFWBPW1jgL8DfhS/BIxvPllczr+nXAs/UzkbwM0K1L0taAA+e4uJPo+qcL/lqKW+3zmcPg=="],"bias":["J9rrPgs/cj7Geeq71orKPg9rz76gin89/vaNPdDYKT/FNxS/q2CBPh6fG76+UC+8iifgv7R+xD4aftI+y1/Wvg=="]},"output":{"weights":["5l0pP7sanr9Mn5i96BJtP+29Gr/INhA/MfVMv4nqJT99EwXAsgaKP6+srr4seD0+QDuuv4FOmD+sCHY/2fibv7EpEb8OHl8/19cWQDA5s796V0k+vPpGPpBE674GWtQ+jNj+P7g6yb8ecXo/Iuuqv8FbUz9vLbS/XZ0hwOQsNEA="],"bias":["aZcKPrWXCr4="]}},"hash":"252c356954db5745b4f9ba1933d657d9b3d926836972d5d3e15d64c3aa8a9895"}