{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_relTime_tightTimeWindowPhysBkg_EMultr_1000epochs_small8","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,8]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,8],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":8,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,8]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,8],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,8]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,8],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,8]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,8],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"dense_layer_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,16]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,16],"dtype":"float32","keras_history":["dense_layer_2",0,0]}}],"kwargs":{}}]}],"input_layers":[["input_layer",0,0]],"output_layers":[["output",0,0]]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["yMHTPg3tAz+X3e+/3n3FP4AtjL6r+JI/B/SNPm2qij6eXQ2+a/CFP0VJf76LJcs/yaeoPwz0bj96BqU/f/8YP0r0W78E0fO9rxN9PxWV8D7wzwJABiCMv5UhLz+fpLa/1PqhP1kkFb+0g2+/ZaAvP7LOHMBEd6K+eMS2PXhhML8QJaE+DN2uv4Nul78EW/y95ebZvltmML+MZC48zYUEPl4mLz/6MZY/lSEFvc353L0Bcpi+7goEQFU8SD8fjDW/tJuIPw=="]}],"outputs":[{"shape":[3],"values":["AAAAAAAAgD8AAAAA"]}]}],"trainable_params":{"conv_layer0":{"weights":["slQAPkI4aj5lL/u+7kckPhYxm71PWsw+slI+v8RM4T4O+4G/1hwtvkzCZcAHg/a++ExCP6qFHb8VBiI/JqWvP8qEkD5wzGc/4+y+PeN4pz4NQWU/zjJlwMvNJL356wG9AJICwVoSl8BNPj+//LYbv9kh6ruaVu+/mD3JvvrZib+Awj08gFgvPfuNPj6Szgi/Zd6MvnP8Ej2Jtw4+zfqxPSzPDT/6TAM+vrYlP4ofPz8fAeU+VZN6vrkyG75/Ue2+C5PbPbCwU7+2eyO/cvAGPdAim73DvxQ+v250P5ynDL55GLo+c+FZPsO8PL45e4C+LbrvPbboE79mLKE+YSWKwGkij8A5Jgo/Sqc4PghHk8BqbVM7nXNTv2wF0L+Whwk/"],"bias":["aVaGPNFfwzuwEGQ8BAAIPSLJTT0Me1o9H7CPPPgY7zs="]},"conv_layer1":{"weights":["CfqPvoMwnz7v4S0+B43Mvpxl7L2sI5I+dM6oPqtyVD/A2hg/H+Idv2oss7/QnIw+IaFMPWIHX767nDq+kjK/vhsB4b5gKfc+xH9dwPnO8j2gX+E9654nPljnVj7LRMW+am5NPrHujz62zy4/lt2svmaBAL45SYW+ekdnvdl4jj7buzW+IeYNv7V50T4jN5++WZLkPvQnL76CkQS+UorkPS3cBD4d4AA/Ef/Sv9DaCj+x7tw+4uPaPig+NjxPpb0/Avbxvkqf0D5FqNY+EyDTvjjIjD3Tzz4+TXaWPm7E9z4HpvI+090vv+HUJb97D0E/Iv4MPyfAS74PRAq/9GXavoJ1m73yLfg+798cwLJxTL4VtSA+Oq9sPAxeNj3eO7e+fGEfvmcdFb5GPzg/57sFv7Dznr2UOO2+ndSzupR+Gz0ANTG+E+4rvvvASD9XvC49LY46Pa4Xl73CWyC+svyEvhbCbz7JILW+KHqkP0EarrveJ1a7FdeePaCqfD6UqrA9wT3EvpeDzj0RpUE6P3arPomKJT7eU9w+1LagvDfevr6qrUQ9YOlEvrKS7b5NPpE+OEF1Pt7+8z1PITq9wAs5v8lxlzqTxO09u5Cyv4S+FT+UvMs9DrHgPk68CDxQzsQ+weEkvr5zdz+NaJM9SfvBPeRrUz4tg8++4vOivtTRf74qm0Y+GAyNvWIXX76428m+GRbkPi+si76BqPq7gYICv7cxWL1EoP0/1rmXv5804b1d4uI+wkj6PUdjnz3Kq02/AOm3Pnw/SD1DllO/td8MPSet3T345es9Txm0vXdaLL/DL989yCHnPjXzCb96gB4/ZeGPPa0jXj6tBqy9iWfHPvHpKT4rXws/+8akPY6ccz7W0+Y9LjZiPv9FQ74HLMQ/AAjHPayCR79+U7i+fLXJvgdZSz5va6e+5gidvUTkhL5j1S66BSJdPjtbFj6/J5o8FuQxvVRT1D0/U7w8lDESP6o/I70sZsE9qHgIPzvjsrx0h4e+GZA0vbSglj7K/rw/","Omw3PS8NgL4TOZi/xvJ8PaEDRT7Ebw4+T0V5PjC9h77EMA++b0vfvgofVr56UIs+LpoRPTODwj7I3uE9YMH0Pqmqar5uEYu9piQKP4mujD5Qstq+Ba+bPlwUlD0+fYA/LiMGPsW4AL/kNMy/vKZzPlkTwT5IPaE+uXSxPvDwIb895sc+IZ+Ovjy+Nr+dyBi+qBhFvYYbHjxOnes8ZEWpv0m66jywDL29ddUTPyNk4r0XZWM+J7/aPbPGZT5+sh3A8N4APcx1C76WFdo9sO33vi2kiT7u+GK++NglvKBrXr8lyNu+nrwEPEpyiD7Fq3q+A5V0PrPRnrzPJzO+omfhPtFtnr4flq+6OM4fQLCQPr7X3PQ9jsbdPQQ7rj43LtE+ItEBP6d8VL9acwe+/dw1v+FAUb7NOxK/KBBHPtAn/T6nMSA+KUv7vrsyDj+ydYK9Z/QPvnka9r6IYqE+41ZUv6EFHT5Vny2/HxTdPwA5GL4teou95q+fvvhDnT6tj58+dbk5PhwtDL8c8DQ/yX0/vz8AP72Ua+a+A1BfPjAoij6A1AU+cCsCv57hgD8LdBS/6DcUvRg3k77y9Eq+n6qbvVGOWL4GC9k9NICfPmXowL5KuR0+RwhAuk85xj482fm9xnHbPk+MRr/6ZKY8q8FIPnYXKz03/FY+dcmePhQpSz8x3BW78fT8vhn4Pr6Vnd898WBtPfUwrL33Dr4+mwcWvrEepj7Qyu2+xwFrPk+thr0CZa6+OW/1vSrZDD7rwMq/uE0EvhbbZb6d/TU+uqlFPGNgrj6o9zM+W/9vPmj1tb66Rvk9m8uEPpvKB76v/sA+R6pzPkc7gz4yFwO9mdsKv8f9TL5rl8G9mZYDvlnzET9xqoY+XjPtPkURUD0N3uM+XplGvnji0z5OJHI9erEhP9kwCr6Yaoo+lpncPY4CTr5dk2O+/GJvPjGeDT+c/Ls+ge9Ju75slD53mD29SPrVPtFylrxr0gq+mVs1PwW3er2wajE+MdOWPTceVr7LWLQ+","Vd/2vSQGiT4l0zy/5qK6PkcseT5C1SA93s0fvsAdVr9MEvK9tcvdPvlfbj6PHMk+d88bPi7SGz7bWqC+yj6WPfW8l76TKi8+ns06PuMtjb0YYWw+pxX0PErzi75V2E0+/8fGPStbND/djDW+S6FevgLVTTxvUlC9kbtEPuzaiz8wTO89kqYBPvAZ9D7O69S+Kxkovp0wVr6x2b+74Xk8P63Q3b1i3gW/LCt4P7GtAb9eLYA+MdbfvuPuFz7bIDM/tb2vvK4koj6SIQq/UpkFP9dicj7mhUI+DU3+PU5ZSb82M0I+Xnzqu+4NZr8I49E+byGEPUBk3T6CSa++voyQv7hcUr1H2r4+RESDvyKq+j7bOIo+ZL7oPtslPr4b1YS/fzONPiFcBz86p9c+IXS7vscTJj5Xhru+uiIKvnHEWL9738q9imEJvvPHF71UaP69Xb7MPj0rIDsmcAu+jyvyviQv3r001vw99gBwvrZWib7sUCE+ZKXCPRFT0j466w3AOOm9vgLIub5DZV4+mLnivp7K3zzrmb++35SpPgrTe784VKw+6ylsv2AYm76fz069oqdjvocX071vneE82rbPv20iXj4/+cC+3ztQvnqYAT4SHZ6+aylUvnzmhz7D0M6/8Xpkvofs+j58aA+/07atPmjHRT6qaYI+SMoSPjA8l74H39g+5tmsvUumf79Y1Io+HN9kPtgBYz0VddK+LB9JvwxaoL5pOFs+2Fm8v1MZWD2b5ZA+VVY/Pgu1Cr5WWHq/186bPWoxyj7i4P4+Ty1UvpUiiz6U6Y6+JKNbvhAUHb906Ji+Q95Cvs4kuL7XZNy9TceRPiQo1T2s6KA92WHnv4CaBL39CZM7+Estv6qwTr4cUCo+w4W3Pkrgdz42ow/AtJFgvvr+fb4tAam9fj93vX+WWb7R4He9rRKxPpDjg79iyLA++YE9v0HqjT3t3P0+KzoBvN8VUL6jpDy+OlGLv7ZIqjwjsRG9kI7fvrkJs73bxoE9idzAvBuhST0Yd96/"],"bias":["qF5wO4EJND0+VZg95f/2PQs26D35N2A7o/SwPdPLYz0="]},"conv_layer2":{"weights":["rI6zvulWuT4j/kM+O0skPRTFjb6UTEM+5B/HPuU9cL4IlA69a3GEvSx56LzM4+09SsaMvQtquz5fzSO+79z1vYdLNb+2TZ09YmO8PXkAS76lCYG+me8aP6wqHD5Uc529BaxbPvLpD74tP6s+G2fXPcYNQr6JdBo9cCUGPlo6tDoZ3/q9JQrzvqzE5j5edaA+7hpXPY93yjvPJ40+DGeaPka7pjyWCxy+rkESvkqW0z62Bko+DIZPPoD8sD7v8VA+phh5v6GgOb6XE2o+Q1KFPpcPsD4lbw0+ARzKPWxLwj24Uii//gO0vKEd8T1Dym098RSgPi33Kj/14yy/sPX0vs6t2L7Z7Te+b8l+vvIcHj355ws+wO7qPJ1Heb4MuIm9us9PvkFctT468bQ9mdsrPnnaGL5WdpM9bnjgPn6DPz4/phS+Q6F5PfcEI72l45S+YXJvviG+kD7p0oe+kNiFvl3bF75sbmA+LcTlvXYvqr2GtR49gMaWPiq+QL6EYEc+OMngPqlIbD6rT6Y+dMptvfRbJ75OPBS+oAweP34TvD66oHa95BLrvqsi1z1pfGE+PLDUPby2OT4nrhQ+k0qpvec/tz7q+Ea9lpa9vQ6Jtj7eihE+b/9LvobGoj7OZZI+G55Bv6qKDb1XQtM9HpVbPj1ZhT4AjrW+uY8BP8BoKj5dQDe/J0jRvQL3dz6vXX4+iHkQPpmJpz6KIyS/FyYcv3Msrj7Frqi+nG0cvcxAgz6rt10+dVkdvjQTs7xnjV29bCf1vJEihz6FgXc+HkUEvopEmL1p98k+HHKbvsJtT731og+/RqdEPhnFm74ND469O8PpPDPsmz64WCu/nn0ivzl2Hb6jZac+nURoPf2lFb2X0ke9NnXDPhKb7745q+q+U2wcP0im3LtfsQI/ExE3PpyGXjyANR0+vf8vPQOqir71pfs8hjbbvr4/Xj7GOJk+HEE2vRgBjD6n1xQ+tC36PYIAMD/QmXc+mMuFvTKLRT7zPQy+BEY0Pg4S6z0uuVM+","28eqPmM0Cb3jJks+n5WHvSjHxD60V56+Kp8+vYJ0jr2mB46+CHlNvgwOpD6wg4C+gSk8Pl5Jcb3cXhi/jjH7vgvpTj/P77K9deZ6PPPJmL1U7Yg9rkbYOXHuE7+aN5W9JlmKPj5qgD7e3l6+AYVOPdVq/T4l0Zo9goMFvvJjFT9+him/pVU9PnsMOz7r2sU+soMTPyctgj43iyS//t/5vqtCzz9f2QI/RZUsuoBwBD6mwKk+GK1uPVpbmD4hTf4+QgFJP4Qevz7Iu/K9n8WZPnmWYz7dAGA+/jsLPj5FCT7qncI6d2ffPZMDTT4NzYE+AFSAPtmOkbxWyP49JRzJPaco+D++bPY+ttCzPZE4tT1sU/M+AMHBvbQkWDxWj90+6nACQK31dj8hgtA9N05WvbAiuj4Bc0a+kYvbPsLy3T5JX6o+gtEWP4Aehz6jjWo9XfimPmRJJr9Gl8G+bdJ+Pa6JFEBI3/w+g/JLPpYLubyClJg+JqQBvYnojj7rpZw+uWsTvoBEOL4UWU0+iaWNvPxq97x/s2u+GDffPsCBzj1tM4Q+DOTXvsuZ+j7Q4DY9P5ToPmSju75/yy4/FDQOP27dlD7YeIy+XX+uPu+QTz2r/Qy+yuOGvjffMj5r3J0+8RfbvkT0Az+Sxgi9zpwtPoNapD6BwQC+5bwWPe99Iz9AHZG+/FcwP3IeNb6HZxK9tc6XPrjApb1pN7289DRCvgn1Lb9SABs+k4CGvUzh7L2tjcs+vsgpvuD6Rr10/DW9k9KUv7ZpQr636nG+4+oOvUI3Pr6ZYK8+5jQTP4u2YL5PZYM+0t9XPs+ZUr6EurQ+rBzxPdcfQj9wvQ8/cCvIPo4fm79hj769x5wXvuSrzz70IJc9+EDfPkpiDT/S9p8+DZr+vdVNtz7OyVk+il21PbmgEb3axw+9W8z2vJf6OD32G8C+r9+OPY+lBD54hs+9vaxiPgOXjb3XVPG+AInFvuDcO7/GwwK+wurnvQfRI70aBPw9OeUBP6DcDL9bI1+/","pfoFP9mUOD3qs+s+ZOP+vAydM76PMkY+44yCvA4jWr5P1Ck+PFdqvmiYwzy5yuE9KtPQPT0ZLz4rph8+UR7bPXBXIT8n2Lc91fnRPaCikz1inDK9VGOJvV8F97vn8Pu8oj3avtnp5r5HCsc+SSNoPqG4Mj513jK+CSIEvGs/ljyrdy2+DCmXvoBOYj7mV2M9vSNePmXYW77CHxa/ao3ivQmXKL5/cIG9dcxMPLwxfD4la+u95LhaPgu4B7/i5Y+908DMvvHJuz0ydsA+6tbZO3PPnz1CjoQ9lrhMPjb4A74Er/C+qcs0vg9IBD2p5Nq+teFWvvTtHz6RBk++Qz6ivWQEiz1sp4M+A9yCvoDy6b7g4/g9O3CgPgJm8b0ekNU7M2/nPQtPaD6qWAQ/hW6mPoKdKb4WNQK8hY8WP1tYjj6vpcI8Zg8Dv94A1z5qx1E+x3wpPcETAT76f448KIq0PeZF9D42cu07MdabvljgUj7INGS+HC/Ou0JHsj6nTwU/glRnvzDYa72B97k+X42ove0DRD51rl6+m7UfPy78uz7Le0y/GMiDvkNNVj4on0M+nrQoPcnRDT9OJ5O+MGHrvt+u+j1g9bi+Oj5qPYQRJj6W71E+CoipPW+DHLsE9Y0+XEumvNALpr0OsRk+EstBvfi3Zzzq0SI+CVY2P0WKQ742/fk+s57EvS0Ugj3zKeK+iHbBPdyK+b3/u6k+3ka/Po4CHL5A6HU+0nQovSHa0L6Gj6O+nDNwPYUeHj8CqBo/I39KvtXuKj6N8rK7kT2yvX+/Tj3xByc+FNE+Pjl0+j4S3ni+GsQHP0Wdlz0o/K29GgY3vjJlyzyXMoG9bnhVvnak1b7eDqS9CXBbvu1/9r0FXwI+L7aZPfDXsD4hBOA+wC6Av7kaD77TTAo+TS1vPi9crr3gQ44+PKypP8zQ0T4gnJs9PRZHvnoKpLxEj3U9fy4yvoVkcT80z1k/jkWKPma+Br/W25O+e0esvfofBj5eWyS+0OqRvJG+az+vuRY/"],"bias":["E7h+PalJMj2R5N09gdl/PuKgLz18sas9Xf2gPI4HrL0="]},"dense_layer_1":{"weights":["lIzkvnj+Pz5wCwo/dhsuPyHQVD5kXhA+dk1BP+d0QD4WrVm/rGuaPe2rDL2Y4sY+Z0s9P1B+/j347No9AV3vvsidEr6wuF8+Fmm0PRJCEj8PnVU9KYwNv6oZWz+/S92+/pPBvg6+JD6iOIe+XmYKP2pbDj6JkIu/UdCCv5vyHL8Cmku9PdceP2HdZ74pJ1Q/zj+BvmKr8D7ym+08OrFzv9o9Zb8o7dK+p5+mvsKWkr5ZH4A/MJjVPv6Tyb75exm/9vDEvuvwmT2Q8q2+uZ35Pstdgr6UgnW9WQI1PiOTf702hTY/yvw4vuz8iTzv4a++WAaMPkwkob6PNPC+j7cbPwjm1T4NsnO/RboBPlzkRL91Z1E/tsUCvKysvL1Uv3k/7FnwPorakL5Fh/m+pN6VuQ0ISL7JrKQ+e+e1Pq13c77C678+YMt/PlavXD62lcw+bFA6vgcwij9nmDC8Sp1ivf1LY78khyk9UBXRvaQMoT6Qzz0/VclKPVoQsr+9AZa/o1mQvTVHEj/zpBA/7d79PhyNwD7F4ci+KuhnP5RuV784lre8C2r1vaA80r4tOQM/YbYsPyPJkb/Rcja+TPPhvu3A2r6O+Ei/oOtwP0Guaj58SIA/kASkvvwrer5Y/Tq+FGD7PkKuvr7NOfA8V60yP6VgJb6zPe0+zvn6Pi6uoL0="],"bias":["yU23uoDngD0uj5u9g/6qPUUU1b3Omls+ckM7vmM7kD4yNEM+J0jQukni4bt3R9S9XlQnPpYzkr1i8++9BKOvPQ=="]},"dense_layer_2":{"weights":["W/A5vlM3kT6eB7S9hfK+vogsC75TacQ+DbhZvhfHyr4Bcmo93MgePtH7175eGbU+vquavkfkLL23PtG9qIS4vsc/Cr43c0i/jy8ruzk/Eb/agd+6eYedPtjkOD+eA749+22Dv1hR7L7sp6o+7oSnvvqpEj557CU+BUKeviU2ir9CU7S+O/XvPgUMZL9whSo/XOcrPhYTJr50yUy/DXO8PrkXuj3aggO/ck57PnyC7L39gAc/Io89vpk/fr6Oi4k9dvCTvrhnH74PoKm+h2LLPpKYVL5ttdO9LJLTPkX8gz75fqs8bTTBPi+03T7iltE+0jcNP4639b7kg7E8WxFNPljyKr6gJEY/pXCDvtuKfz9Ixbm9J4tCPrJ4g7/AMK6+aMSVvdRMKD42m8u+d9cyvuhokz02C6A++c2WvtXSjD+Yy5Y+qKfqvsszdT+eFHs/BOm4vs7ggL5gxSO/IQo5P5hWab8YlF++nJ/kPYrxZr+lLHY/H0cQPsF6nz65dxk/wvhcPmHMsD6jKf6+pvmqPg6d3z17MNU9LzLQPswOBb9j+Zc+ZBADP5pevT2ZCY++ej11PqVRU74M0pQ+iC1HvWdOtL63iw89zjZAPzfnF78JjM6+WAPyvtGBtj9WbVQ+2qQ5vnAnIr85G2s/bM6kvjc22D5JtFs+yxVNPp5lWb84WpC+GzHrPbdWUD8ZbU29576/PRyrvT1g9iW/nueWvj3cHT9z14M/loRIvxds/T74+Aa/zfugvpGQUr74WiM++oF4Ph2+Iz7+5ZO+YUKSvuA7kjxGe9A91jagPgKgmj5gmMe8IeiGvrbhw77ZYKU++KPSvjQx5L0Rj428mTtbPmzhwT198ri+lfo9PkvJxb3QpoQ8kkASPqBrwL0aQpa+BOoGPfbxgjw84iG+F+PYvlcyuz2WoQe+YbiEPlDbkj4Ro4q+06UiPy9+gb+533g/OjFhvQX/sL6xHQm/RunIvZDjDD8jtTA+6ZVePW2xBz/v8s++fldavRhijL4b74o+","NVChPf13eb7H4+M9UA4EPbVZ1r4OpM++4UX0Phdw/b3w+0i+xuVQOATHAT32T4m+sm4bP97eHz6YGe2+maitPmmJsj5sCJq/yHx9P85grr9zOpc9rX2JPcEnL73M/zK/v2WkP2qZ0j/0nFG/HqLbP8WLDr7fb7k+/jewvvugC78h/rG+mHSgv/LVnz9dRL6/Tksgvms/ND66rHc+7T+uvpcmD0BXMBZALsOJvj8Z/z/qPCq/EiodP9GHhL51NWy/FViuPlD9/r77OBI/t4XkvrTmkT2WZAK+WzmdPAne2D3uqFY/3ayvPpYSk74//3o/vFiqvSB5d752G4g+ds9kvg=="],"bias":["VtAMvIr9Q71p8cI+vjaLPApLWr2xvJ283VD5PWkCdz6ld1U9UcMCPFSExD2g1Ve7CueHPvbx2zxxypa9KJu1PQ=="]},"output":{"weights":["fPq0Pn7UbL5veQO/x8dEP9Cbpr2K9iU+mHNOv43Zhz+CiKk/6DjZPg5Jgr8+bWQ94iosPk0/B77O8MG+FDPPvSHr5L4E3cI+xp7lv1LH7j9L1J8/dLEqO3X6kb9zLxo/RgkhP16FNT8fEQe/Ep8HPt4VWz7j4DW/PN35vqrKi7tmIFY/Q4prPlXjFj+Xe5y//eXdPiXkwL1KJjQ/6FZ6vz2lbz/9eJm/qe41vWXe3L7TH1i+CwFvPztdj7+ljaW+"],"bias":["OqDlPRbDJb0g42u9"]}},"hash":"5b148025d2f858ac4155c7fb490e0320efe36e27a1dec35245b446e18e4a07d2"}