{"architecture":{"module":"keras.src.models.functional","class_name":"Functional","config":{"name":"KU-CNN_detector_v9p1p4_newKerasVer_1500epochs_small3_CMS","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,7,7,1],"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer"},"registered_name":null,"name":"input_layer","inbound_nodes":[]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer0","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,7,7,1]},"name":"conv_layer0","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,7,7,1],"dtype":"float32","keras_history":["input_layer",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,5,5,3]},"name":"conv_layer1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,5,5,3],"dtype":"float32","keras_history":["conv_layer0",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Conv2D","config":{"name":"conv_layer2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"filters":3,"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"groups":1,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3,3,3]},"name":"conv_layer2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3,3,3],"dtype":"float32","keras_history":["conv_layer1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Flatten","config":{"name":"flatten","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"data_format":"channels_last"},"registered_name":null,"build_config":{"input_shape":[null,1,1,3]},"name":"flatten","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,1,1,3],"dtype":"float32","keras_history":["conv_layer2",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,3]},"name":"dense_layer_1","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,3],"dtype":"float32","keras_history":["flatten",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_layer_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":6,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"dense_layer_2","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_1",0,0]}}],"kwargs":{}}]},{"module":"keras.layers","class_name":"Dense","config":{"name":"output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,6]},"name":"output","inbound_nodes":[{"args":[{"class_name":"__keras_tensor__","config":{"shape":[null,6],"dtype":"float32","keras_history":["dense_layer_2",0,0]}}],"kwargs":{}}]}],"input_layers":["input_layer",0,0],"output_layers":["output",0,0]},"registered_name":"Functional","build_config":{"input_shape":null},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"SGD","config":{"name":"SGD","learning_rate":0.009999999776482582,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"momentum":0.0,"nesterov":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":null,"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":false}},"image_data_format":"channels_last","input_shapes":[[7,7,1]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[7,7,1],"values":["oT2hv7JZNT6cS8I9IryyP4hcqr67BP6/bbznvnS0xD9nYga+1G3nvz21WL2YfzA9vZjvP00ZuD+y2tI/kbS7vlC4Z7+duGS/14oWPup7hT+Z4ATAylkUvq1orD9R7t8/cOVeP0XgUj/go18/Hw9iP6foU780VKw/ZPHYP8n5MT//bgU/V7aHv+QwCsB64gzApBpzvzcGCr8Xp9k+juk8Px9Woz9/R6W+tFfhvoys77/FCe0/C+vmPc0cmT6tjxBASJA8Pw=="]}],"outputs":[{"shape":[3],"values":["AAAAALu83gcAAIA/"]}]}],"trainable_params":{"conv_layer0":{"weights":["lY1bvtnYm79h1Ru9YdwNv1yy68Cb6yS+LSYBP+12T8GGwpe/+ktHPcK/pT+WIRY/2XxLP482iz9GeAw/7GSkPwoU9b24Qis+7zxqvhYNCT/RlXE/TXeyPo8qnD0wNpA++r8RwSU/PT+xXb7A"],"bias":["oUaMPpSTPr3vPYO7"]},"conv_layer1":{"weights":["B/8VP7N7Rj88giXAnchevw3UlT+GF42+mX6ZPv/iS73IiJ6/0PvGP+gUCb8ZBQC+uml0v9dowL281no+iMxuP9d6fj7YUqY+FAJeP2lmzj4XTCq/KDBSv7tnXz+8GYA9IPsYP+3v0j5M1T3AAirxP0PmHz+TaIo/4qAdwDgWNj9cMJE/X7mbPtM1hT8LeaC/KvhTP1O8Or9MRIY+96KPPgMCMT5kZyU+gFSQP7yZbT4fOsA+ABhdvhyXQL+IJKM+lsh2PxDLWTqg/FI//IOsPkZBUD13viE/6yZOP7LRNj9rrwZAcaUHP73KFz//zPc+zsMtv9Kbs71OLbK9JVbyPpqAF79fo7M+mHxRP1hB3b5+QSE+lwGEP3NYjj64NcA/1ZIgv2CsWT9cNhs/NZ2+vh82Qr+ISbQ/kC4fvxzmIb93mF8/"],"bias":["qFxZvzwGLr1+5+i+"]},"conv_layer2":{"weights":["NMT6vfIdhL7Jhn0/77uPPybzY75I257ACiJVPw9Hkr+7zwLAXfsLvz/dKL6kB5I/2M7Mv2BQVL+QuCjAz1FsvqXZ/zyNFhu/Y9dLPuZwKT/oofe+Uexzv2aXNj6VClG9q4y1vdGtPj/FAT0+o3lCvXnhv799YVFA+5R4P/74vr/rg1c/W5F6Py+04L9MzpQ/HfrUv+5KZj+SkPQ+l9cqP5YUjb6d1nk/PJIqvtN0wj7Ill8/zySyvoYrNryr5zO/GgPrvzYmRj/cEpe/NJvXvx8i7T780Ic9cDG2vhoDJj5bhGm+q9gBPqzy073CZVA+zWf1vahNMT62FE++q7hivi/Klr4uF4O+nVGTvtS9t76WKiI+9BCSvmATob1W54q+wSWHvDjivz370BS+6hTIvnxII77oj3w9x8QUPZBcUDz7AWW+"],"bias":["TJ81P0vbUT+G9r+9"]},"dense_layer_1":{"weights":["omQLPwXVoD8jyYo/IekTPgRScb7gtYi8Inrgvgr2uz/jGIa/P1wTv57sJL9ulyq/vwizvpThyj0NS0K/cuclP6m0qr7EDRM/"],"bias":["yQS1P7G/cr+XbUk+viiQvgAAAAAAAAAA"]},"dense_layer_2":{"weights":["IDbvPbz/gMBe+v0/QKcBPnaJJr/TVJ2+KeiTPzsDlD+tpgo+8+u1P+nXrj+SHi+/ZOf4P7tSGsGVVmS9102+v9nr/j/y2wC/S7SHPmIaV76tVgC/MPEtPvborz4yqfU+CQQsP7Brer1SH/++cJ02Pnp4Ar8IYCC/utK9PjPwDD9dVCc/pjOjvv7a8r4Aqqu8"],"bias":["7EJfv/5YPb/G0HU/GMZcPyR/Mr8AAAAA"]},"output":{"weights":["LuYlPv+/vb/pM72+Vzbjv8Wu6D+M2TFAmou8vnLGnT/hGvO+AQAevg55rL9SYLU/+NzBPzaksD/3fAfA+sSUvtJaAb+4QSs/"],"bias":["RSUmwDdUkD9fEzU/"]}},"hash":"5936606e6d4e60331c1a6140cedd674cad38ac01ec2d22b0a13e844c30af8da7"}